#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.auth: Refreshing state... [id=/aws/apigateway/AuthAPI]
aws_cloudwatch_log_group.convert_jwt: Refreshing state... [id=/aws/lambda/convert-jwt]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-1:075673041815:certificate/9a8f0dec-f46e-4184-a425-051990b211ca]
aws_apigatewayv2_api.auth: Refreshing state... [id=0yvm6xre7a]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_ssm_parameter.cloudfront_signer_key: Refreshing state... [id=/cloudfront/signer_key]
aws_apigatewayv2_stage.auth: Refreshing state... [id=$default]
aws_route53_record.api_cert_validate["api.melvyn.dev"]: Refreshing state... [id=Z07752236W5ND1V05CXM__ff208cc4349d15b5faa3f14bebb2f38a.api.melvyn.dev._CNAME]
aws_iam_role_policy.lambda_policy: Refreshing state... [id=iam_for_lambda:lambda_policy]
aws_lambda_function.convert_jwt: Refreshing state... [id=convert-jwt]
aws_acm_certificate_validation.api: Refreshing state... [id=2022-05-10 21:03:36.504 +0000 UTC]
aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.melvyn.dev]
aws_apigatewayv2_api_mapping.auth: Refreshing state... [id=e9fnyd]
aws_route53_record.api: Refreshing state... [id=Z07752236W5ND1V05CXM_api.melvyn.dev_A]
aws_apigatewayv2_integration.auth: Refreshing state... [id=vxl7csu]
aws_lambda_permission.convert_jwt: Refreshing state... [id=AllowAuthAPIInvoke]
aws_apigatewayv2_route.auth: Refreshing state... [id=l37hm4k]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_policy"  {
      ~ id      = "1614040131" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:eu-west-1:075673041815:log-group:/aws/lambda/convert-jwt:*",
                          - "arn:aws:logs:eu-west-1:075673041815:log-group:/aws/lambda/convert-jwt",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-1:075673041815:key/8a8fde17-57c1-44bd-8e43-c1d8a87f3b88"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameter"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-west-1:075673041815:parameter/cloudfront/signer_key"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_iam_role_policy.lambda_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_policy" {
        id     = "iam_for_lambda:lambda_policy"
        name   = "lambda_policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:eu-west-1:075673041815:log-group:/aws/lambda/convert-jwt:*",
                          - "arn:aws:logs:eu-west-1:075673041815:log-group:/aws/lambda/convert-jwt",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-1:075673041815:key/8a8fde17-57c1-44bd-8e43-c1d8a87f3b88"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameter"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-west-1:075673041815:parameter/cloudfront/signer_key"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.convert_jwt will be updated in-place
  ~ resource "aws_lambda_function" "convert_jwt" {
      ~ architectures                  = [
          - "x86_64",
          + "arm64",
        ]
        id                             = "convert-jwt"
      ~ last_modified                  = "2022-05-12T19:34:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "nouYtUlel97g9ZyIU3d2nYwSx+TbVItPP+OcWF+hWwk=" -> "fX0Mp9keVax30DuHVGL5pBGKEWrB906bP9c9hBm2Tog="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ssm_parameter.cloudfront_signer_key will be updated in-place
  ~ resource "aws_ssm_parameter" "cloudfront_signer_key" {
        id              = "/cloudfront/signer_key"
        name            = "/cloudfront/signer_key"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @melvyndekort, Action: `pull_request`*